Project-> Explore titanic dataset and explore about the people, both those who survived and those who did not. With today's technology, answering through data analysis is now easier then ever.

In [1]:
from sklearn import datasets
import numpy as np
import pandas as pd

In [2]:
from IPython.display import Image
Image(url= "https://static1.squarespace.com/static/5006453fe4b09ef2252ba068/5095eabce4b06cb305058603/5095eabce4b02d37bef4c24c/1352002236895/100_anniversary_titanic_sinking_by_esai8mellows-d4xbme8.jpg")

In [3]:
train = pd.read_csv("train4.csv",delimiter=",")
test = pd.read_csv("test4.csv",delimiter=",")

In [4]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [5]:
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [6]:
train_test_data = [train, test]
train.drop("Name",axis=1,inplace=True)
test.drop("Name",axis=1,inplace=True)

In [7]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,female,29.0,1,0,228414,26.000,NaN,S,1
1,3,male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,male,39.0,0,0,250655,26.000,NaN,S,0
3,3,female,29.0,0,4,349909,21.075,NaN,S,0
4,3,male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [8]:
test.head()

   Pclass     Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
0       2    male   8.0      1      1  C.A. 33112  36.7500   NaN        S
1       1  female  49.0      0      0       17465  25.9292   D17        S
2       3    male   NaN      0      0       36865   7.7375   NaN        Q
3       2  female  24.0      2      1      243847  27.0000   NaN        S
4       1    male  36.0      0      0    PC 17473  26.2875   E25        S

In [9]:
sex_mapping = {"male":0,"female":1}
for dataset in train_test_data:
    dataset["Sex"] = dataset["Sex"].map(sex_mapping)

In [10]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,1,29.0,1,0,228414,26.000,NaN,S,1
1,3,0,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,0,39.0,0,0,250655,26.000,NaN,S,0
3,3,1,29.0,0,4,349909,21.075,NaN,S,0
4,3,0,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [11]:
test.head()

   Pclass  Sex   Age  SibSp  Parch      Ticket     Fare Cabin Embarked
0       2    0   8.0      1      1  C.A. 33112  36.7500   NaN        S
1       1    1  49.0      0      0       17465  25.9292   D17        S
2       3    0   NaN      0      0       36865   7.7375   NaN        Q
3       2    1  24.0      2      1      243847  27.0000   NaN        S
4       1    0  36.0      0      0    PC 17473  26.2875   E25        S

In [12]:
train.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [13]:
test.isnull().sum()

Pclass        0
Sex           0
Age          45
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       173
Embarked      1
dtype: int64

In [14]:
train["Age"].fillna(train.Age.mean(),inplace=True)
test["Age"].fillna(test.Age.mean(),inplace=True)

In [15]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 10 columns):
Pclass      668 non-null int64
Sex         668 non-null int64
Age         668 non-null float64
SibSp       668 non-null int64
Parch       668 non-null int64
Ticket      668 non-null object
Fare        668 non-null float64
Cabin       154 non-null object
Embarked    667 non-null object
Survived    668 non-null int64
dtypes: float64(2), int64(5), object(3)
memory usage: 52.3+ KB

In [16]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 9 columns):
Pclass      223 non-null int64
Sex         223 non-null int64
Age         223 non-null float64
SibSp       223 non-null int64
Parch       223 non-null int64
Ticket      223 non-null object
Fare        223 non-null float64
Cabin       50 non-null object
Embarked    222 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 15.8+ KB

In [17]:
for i in train_test_data:
    i["Embarked"] = i["Embarked"].fillna("S")

In [18]:
train.Embarked.value_counts()

S    485
C    133
Q     50
Name: Embarked, dtype: int64

In [19]:
embarked_mapping = {"S":0,"C":1,"Q":2}
for i in train_test_data:
    i["Embarked"] = i["Embarked"].map(embarked_mapping)

In [20]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,1,29.00000,1,0,228414,26.000,NaN,0,1
1,3,0,29.70056,0,0,A/5 2466,8.050,NaN,0,0
2,2,0,39.00000,0,0,250655,26.000,NaN,0,0
3,3,1,29.00000,0,4,349909,21.075,NaN,0,0
4,3,0,25.00000,0,0,SOTON/OQ 392076,7.050,NaN,0,0

In [21]:
test.head()

   Pclass  Sex        Age  SibSp  Parch      Ticket     Fare Cabin  Embarked
0       2    0   8.000000      1      1  C.A. 33112  36.7500   NaN         0
1       1    1  49.000000      0      0       17465  25.9292   D17         0
2       3    0  29.694775      0      0       36865   7.7375   NaN         2
3       2    1  24.000000      2      1      243847  27.0000   NaN         0
4       1    0  36.000000      0      0    PC 17473  26.2875   E25         0

In [22]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 10 columns):
Pclass      668 non-null int64
Sex         668 non-null int64
Age         668 non-null float64
SibSp       668 non-null int64
Parch       668 non-null int64
Ticket      668 non-null object
Fare        668 non-null float64
Cabin       154 non-null object
Embarked    668 non-null int64
Survived    668 non-null int64
dtypes: float64(2), int64(6), object(2)
memory usage: 52.3+ KB

In [23]:
# Cabin

train.Cabin.value_counts()

G6             4
C23 C25 C27    3
B96 B98        3
E44            2
C92            2
C22 C26        2
F33            2
B5             2
C68            2
E24            2
D20            2
B20            2
D33            2
C2             2
C83            2
C123           2
E67            2
B22            2
F4             2
B49            2
C125           2
F G73          2
F2             2
C124           2
D              2
E121           2
E101           2
B35            2
D35            2
C93            2
              ..
B101           1
A10            1
C104           1
C110           1
B30            1
C91            1
B79            1
C70            1
B28            1
B102           1
A6             1
D30            1
C49            1
D28            1
D26            1
B37            1
C32            1
E68            1
F E69          1
B4             1
F G63          1
D48            1
C65            1
A32            1
C85            1
E40            1
D49            1
C106           1
C45            1
C118           1
Name: Cabin, Length: 119, dtype: int64

In [24]:
for i in train_test_data:
    i["Cabin"] = i["Cabin"].str[:1]

In [25]:
train.Cabin.value_counts()

C    46
B    32
D    26
E    25
F    10
A    10
G     4
T     1
Name: Cabin, dtype: int64

In [26]:
cabin_mapping = {"A":0.0,"B":0.4,"C":0.8,"D":1.2,"E":1.6,"F":2.0,"G":2.4,"T":2.8}
for i in train_test_data:
    i["Cabin"] = i["Cabin"].map(cabin_mapping)

In [27]:
train["Cabin"].fillna(train.Cabin.mean(),inplace=True)
test["Cabin"].fillna(test.Cabin.mean(),inplace=True)

In [28]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,1,29.00000,1,0,228414,26.000,0.994805,0,1
1,3,0,29.70056,0,0,A/5 2466,8.050,0.994805,0,0
2,2,0,39.00000,0,0,250655,26.000,0.994805,0,0
3,3,1,29.00000,0,4,349909,21.075,0.994805,0,0
4,3,0,25.00000,0,0,SOTON/OQ 392076,7.050,0.994805,0,0

In [29]:
train["FamilySize"] = train["SibSp"] + train["Parch"] + 1
test["FamilySize"] = test["SibSp"] + test["Parch"] + 1

In [30]:
train["FamilySize"].max()

11

In [31]:
test["FamilySize"].max()

11

In [32]:
family_mapping = {1:0,2:0.4,3:0.8,4:1.2,5:1.6,6:2.0,7:2.4,8:2.8,9:3.2,10:3.6,11:4.0}
for i in train_test_data:
    i["FamilySize"] = i["FamilySize"].map(family_mapping)

In [33]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 11 columns):
Pclass        668 non-null int64
Sex           668 non-null int64
Age           668 non-null float64
SibSp         668 non-null int64
Parch         668 non-null int64
Ticket        668 non-null object
Fare          668 non-null float64
Cabin         668 non-null float64
Embarked      668 non-null int64
Survived      668 non-null int64
FamilySize    668 non-null float64
dtypes: float64(4), int64(6), object(1)
memory usage: 57.5+ KB

In [34]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 10 columns):
Pclass        223 non-null int64
Sex           223 non-null int64
Age           223 non-null float64
SibSp         223 non-null int64
Parch         223 non-null int64
Ticket        223 non-null object
Fare          223 non-null float64
Cabin         223 non-null float64
Embarked      223 non-null int64
FamilySize    223 non-null float64
dtypes: float64(4), int64(5), object(1)
memory usage: 17.5+ KB

In [35]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,FamilySize
0,2,1,29.00000,1,0,228414,26.000,0.994805,0,1,0.4
1,3,0,29.70056,0,0,A/5 2466,8.050,0.994805,0,0,0.0
2,2,0,39.00000,0,0,250655,26.000,0.994805,0,0,0.0
3,3,1,29.00000,0,4,349909,21.075,0.994805,0,0,1.6
4,3,0,25.00000,0,0,SOTON/OQ 392076,7.050,0.994805,0,0,0.0

In [36]:
test.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,2,0,8.000000,1,1,C.A. 33112,36.7500,0.84,0,0.8
1,1,1,49.000000,0,0,17465,25.9292,1.20,0,0.0
2,3,0,29.694775,0,0,36865,7.7375,0.84,2,0.0
3,2,1,24.000000,2,1,243847,27.0000,0.84,0,1.2
4,1,0,36.000000,0,0,PC 17473,26.2875,1.60,0,0.0

In [37]:
train["Fare"].max(),test["Fare"].max()

(512.3292, 512.3292)

In [38]:
train.Fare.value_counts()

13.0000     36
8.0500      34
7.8958      31
7.7500      23
26.0000     22
10.5000     18
0.0000      13
7.2292      12
7.9250      11
26.5500     10
7.2500      10
7.7750      10
7.8542       9
7.2250       9
8.6625       8
16.1000      7
24.1500      7
31.2750      6
9.5000       6
7.0500       6
21.0000      6
56.4958      6
14.5000      6
15.5000      6
39.6875      6
14.4542      5
73.5000      5
27.7208      5
69.5500      5
26.2500      5
            ..
34.0208      1
6.8583       1
13.8625      1
211.5000     1
40.1250      1
12.0000      1
6.4958       1
80.0000      1
32.5000      1
76.2917      1
51.4792      1
26.3875      1
61.3792      1
8.4583       1
83.1583      1
9.8417       1
8.0292       1
9.2167       1
23.4500      1
13.7917      1
25.9250      1
7.7417       1
7.7375       1
13.4167      1
49.5042      1
93.5000      1
37.0042      1
36.7500      1
164.8667     1
19.9667      1
Name: Fare, Length: 212, dtype: int64

In [39]:
for i in train_test_data:
    i.loc[ i["Fare"] <= 17, "Fare"] = 0,
    i.loc[(i["Fare"] > 17) & (i["Fare"] <= 30), "Fare"] = 1,
    i.loc[(i["Fare"] > 30) & (i["Fare"] <= 100), "Fare"] = 2,
    i.loc[ i["Fare"] > 100, "Fare"] = 3

In [40]:
features_drop = ["Ticket", "Parch", "SibSp"]
train = train.drop(features_drop,axis=1)
test = test.drop(features_drop,axis=1)

In [41]:
train_data = train.drop("Survived", axis=1)
target = train["Survived"]
train_data.shape,target.shape

((668, 7), (668,))

In [51]:
df = pd.DataFrame(train_data)
df.columns = ['1','2','3','4','5','6','7']
for i in df.columns:
    name = i+"_"+i
    df[name] = df[i]**2
df.describe()
train_data = df.values
train_data.shape

(668, 14)

In [52]:
df1 = pd.DataFrame(test)
df1.columns = ['1','2','3','4','5','6','7']
for i in df1.columns:
    name = i+"_"+i
    df1[name] = df1[i]**2
df1.describe()
test = df1.values
test.shape

(223, 14)

In [59]:
from sklearn import preprocessing

In [60]:
scaler = preprocessing.StandardScaler()
scaler.fit(train_data)
train_data = scaler.transform(train_data)
test = scaler.transform(test)

In [61]:
from sklearn.linear_model import LogisticRegression

In [62]:
clf = LogisticRegression()

In [63]:
clf.fit(train_data,target)

C:\Users\MANJEET KUMAR NISHAD\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [64]:
clf.score(train_data, target)

0.8053892215568862

In [65]:
y_pred = clf.predict(test)

In [66]:
np.savetxt("titanic.csv",y_pred)